/*
 * scsi_cmds.inc
 *
 *  Created on: Nov 4, 2018
 *      Author: Zekrom_64
 */

#ifndef LTOS_API_BUS_SCSI_CMDS_INC_
#define LTOS_API_BUS_SCSI_CMDS_INC_

#include "scsi.h"
#include "ltos/ltmacros.h"

// Specification via Seagate: https://www.seagate.com/staticfiles/support/disc/manuals/Interface%20manuals/100293068c.pdf

namespace ltos::SCSI {

	typedef uint32be_t SCSIShortBlockAddr;
	typedef uint64be_t SCSILongBlockAddr;
	LT_PACK_PREFIX
	struct SCSICHSByteAddr {
		uint8_t cylinder[3];
		uint8_t head;
		uint32be_t byteOffset;
	} LT_PACK_ATTRIB;
	LT_PACK_SUFFIX
	LT_ASSERT_SIZEOF(SCSICHSByteAddr, 8)
	LT_ASSERT_OFFSETOF(SCSICHSByteAddr, cylinder, 0)
	LT_ASSERT_OFFSETOF(SCSICHSByteAddr, head, 3)
	LT_ASSERT_OFFSETOF(SCSICHSByteAddr, byteOffset, 4)
	LT_PACK_PREFIX
	struct SCSICHSSectorAddr {
		uint8_t cylinder[3];
		uint8_t head;
		uint32be_t sectorNumber;
	} LT_PACK_ATTRIB;
	LT_PACK_SUFFIX
	LT_ASSERT_SIZEOF(SCSICHSSectorAddr, 8)
	LT_ASSERT_OFFSETOF(SCSICHSSectorAddr, cylinder, 0)
	LT_ASSERT_OFFSETOF(SCSICHSSectorAddr, head, 3)
	LT_ASSERT_OFFSETOF(SCSICHSSectorAddr, sectorNumber, 4)

#define SCSI_MAKE_FIELD(B,O,S) ((O<<6)|(B<<3)|(S))
#define SCSI_FIELD_GETTER \
	inline int getField(int fieldID) { \
		uint8_t fieldByte = ((uint8_t*)this)[fieldID>>6]; \
		fieldByte >>= ((fieldID>>3)&0b111); \
		uint8_t mask = 0, bitcount = (fieldID&0x7); \
		while(bitcount-->0) { mask = (mask << 1) | 1; } \
		return mask & fieldByte; \
	}

	/* ---------------------
	 * | CHANGE DEFINITION |
	 * --------------------- */

	LT_DEPRECATE("SCSI command \"CHANGE_DEFINITION\" declared obsolete by T10 committee")
	enum SCSI__CHANGE_DEFINITION__DEFINITION_PARAM {
		SCSI_DEFINITION_PARAM__USE_CURRENT = 0x00,
		SCSI_DEFINITION_PARAM__SCSI_2 = 0x03,
		SCSI_DEFINITION_PARAM__SCSI_3 = 0x04,
		SCSI_DEFINITION_PARAM__MFG_DEFAULT = 0x3F,
	};

	LT_DEPRECATE("SCSI command \"CHANGE_DEFINITION\" declared obsolete by T10 committee")
	inline SCSICommand12 CHANGE_DEFINITION(bool save, SCSI__CHANGE_DEFINITION__DEFINITION_PARAM defParam,
			uint8_t paramLength) {
		SCSICommand12 cmd = {};
		cmd.op = 0x40;
		cmd.data_bytes[3] = save ? 1 : 0;
		cmd.data_bytes[4] = defParam & 0x7F;
		cmd.data_bytes[9] = paramLength;
		return cmd;
	}

	/* ---------------
	 * | FORMAT UNIT |
	 * --------------- */

	enum SCSI__FORMAT_UNIT__DEFECT_LIST_FORMAT {
		SCSI_DEFECT_LIST_FORMAT__NONE = 0,
		SCSI_DEFECT_LIST_FORMAT__SHORT_BLOCK = 0,
		SCSI_DEFECT_LIST_FORMAT__LONG_BLOCK = 3,
		SCSI_DEFECT_LIST_FORMAT__CHS_BYTE = 4,
		SCSI_DEFECT_LIST_FORMAT__CHS_SECTOR = 5
	};
	enum SCSI__FORMAT_UNIT__PARAMLIST_FLAGS {
		SCSI_FORMAT_UNIT_FLAG__FOV  = 0b10000000,
		SCSI_FORMAT_UNIT_FLAG__DPRY = 0b01000000,
		SCSI_FORMAT_UNIT_FLAG__DCRT = 0b00100000,
		SCSI_FORMAT_UNIT_FLAG__STPF = 0b00010000,
		SCSI_FORMAT_UNIT_FLAG__IP =   0b00001000,
		SCSI_FORMAT_UNIT_FLAG__IMMED = 0b00000010
	};
	enum SCSI__FORMAT_UNIT__IP_MODIFIER {
		SCSI_FORMAT_UNIT_IPMOD__NONE = 0,
		SCSI_FORMAT_UNIT_IPMOD__LOGICAL = 0x40,
		SCSI_FORMAT_UNIT_IPMOD__PHYSICAL = 0x80
	};
	enum SCSI__FORMAT_UNIT__IP_TYPE {
		SCSI_FORMAT_UNIT_IPTYPE__DEFAULT = 0,
		SCSI_FORMAT_UNIT_IPTYPE__PATTERN = 1
	};
	constexpr int SCSI_FORMAT_UNIT__SECURITY_INIT = 0x20;

	template<bool LONG>
	struct SCSI__FORMAT_UNIT__PARAMLIST {};

	template<>
	struct SCSI__FORMAT_UNIT__PARAMLIST<false> {
		uint8_t protFieldsUsage;
		uint8_t flags;
		uint16be_t defectListLength;
	};
	LT_ASSERT_SIZEOF(SCSI__FORMAT_UNIT__PARAMLIST<false>, 4)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PARAMLIST<false>, protFieldsUsage, 0)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PARAMLIST<false>, flags, 1)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PARAMLIST<false>, defectListLength, 2)
	template<>
	struct SCSI__FORMAT_UNIT__PARAMLIST<true> {
		uint8_t protFieldUsage;
		uint8_t flags;
		uint8_t reserved0;
		uint8_t protIntervalInfo;
		uint32be_t defectListLength;
	};
	LT_ASSERT_SIZEOF(SCSI__FORMAT_UNIT__PARAMLIST<true>, 8)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PARAMLIST<true>, protFieldUsage, 0)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PARAMLIST<true>, flags, 1)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PARAMLIST<true>, protIntervalInfo, 3)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PARAMLIST<true>, defectListLength, 4)
	template<int PATTERN_LENGTH>
	struct SCSI__FORMAT_UNIT__PATTERN_DESCRIPTOR {
		uint8_t flags;
		uint8_t patternType;
		uint16be_t patternLength;
		uint8_t pattern[PATTERN_LENGTH];
	};
	LT_ASSERT_SIZEOF(SCSI__FORMAT_UNIT__PATTERN_DESCRIPTOR<0>, 4)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PATTERN_DESCRIPTOR<0>, flags, 0)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PATTERN_DESCRIPTOR<0>, patternType, 1)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PATTERN_DESCRIPTOR<0>, patternLength, 2)
	LT_ASSERT_OFFSETOF(SCSI__FORMAT_UNIT__PATTERN_DESCRIPTOR<0>, pattern, 4)

	inline SCSICommand6 FORMAT_UNIT(uint8_t fmtpInfo, bool longList, bool fmtData, bool cmpList,
			SCSI__FORMAT_UNIT__DEFECT_LIST_FORMAT defectLstFmt) {
		SCSICommand6 cmd = {};
		cmd.op = 0x04;
		cmd.data_bytes[0] = (fmtpInfo << 6) | (longList ? 0x20 : 0) | (fmtData ? 0x10 : 0) | (cmpList ? 0x08 : 0) | defectLstFmt;
		return cmd;
	}

	/* -----------
	 * | INQUIRY |
	 * ----------- */

	enum SCSI__INQUIRY__FIELD {
		SCSI_INQUIRY__PERIPHERAL_QUALIFIER = SCSI_MAKE_FIELD(0,5,3),
		SCSI_INQUIRY__PERIPHERAL_DEVICE_TYPE = SCSI_MAKE_FIELD(0,0,5),
		SCSI_INQUIRY__REMOVEABLE_MEDIA = SCSI_MAKE_FIELD(1,7,1),
		SCSI_INQUIRY__NORMAL_ACA = SCSI_MAKE_FIELD(3,5,1),
		SCSI_INQUIRY__HIERARCH_SUPPORT = SCSI_MAKE_FIELD(3,4,1),
		SCSI_INQUIRY__RESPONSE_FORMAT = SCSI_MAKE_FIELD(3,0,4),
		SCSI_INQUIRY__SCC_SUPPORTED = SCSI_MAKE_FIELD(5,7,1),
		SCSI_INQUIRY__ACCESS_CONTROL_COORD = SCSI_MAKE_FIELD(5,6,1),
		SCSI_INQUIRY__TARGET_PORT_SUPPORT = SCSI_MAKE_FIELD(5,4,2),
		SCSI_INQUIRY__THIRD_PARTY_COPY = SCSI_MAKE_FIELD(5,3,1),
		SCSI_INQUIRY__PROTECTION_INFO = SCSI_MAKE_FIELD(5,0,1),
		SCSI_INQUIRY__BASIC_QUEUEING = SCSI_MAKE_FIELD(6,7,1),
		SCSI_INQUIRY__ENCLOSURE_SERVICES = SCSI_MAKE_FIELD(6,6,1),
		SCSI_INQUIRY__MULTI_PORT = SCSI_MAKE_FIELD(6,4,1),
		SCSI_INQUIRY__MEDIUM_CHANGER = SCSI_MAKE_FIELD(6,3,1),
		SCSI_INQUIRY__LINKED = SCSI_MAKE_FIELD(7,3,1),
		SCSI_INQUIRY__COMMAND_QUEUEING = SCSI_MAKE_FIELD(7,1,1),
		SCSI_INQUIRY__WIDE_SCSI_ADDRESS = SCSI_MAKE_FIELD(6,0,1),
		SCSI_INQUIRY__16BIT_TRANSFERS = SCSI_MAKE_FIELD(7,5,1),
		SCSI_INQUIRY__SYNCHRONOUS_TRANSFER = SCSI_MAKE_FIELD(7,4,1),
		SCSI_INQUIRY__CLOCKING = SCSI_MAKE_FIELD(56,2,2),
		SCSI_INQUIRY__QUICK_ARBIT_AND_SEL = SCSI_MAKE_FIELD(56,1,1),
		SCSI_INQUIRY__INFO_UNITS_SUPPORTED = SCSI_MAKE_FIELD(56,0,1)
	};

	enum SCSI__INQUIRY__PERIPHERAL_QUALIFIER {
		SCSI_INQUIRY_PERIPHERAL_QUALIFIER__CONNECTED = 0,
		SCSI_INQUIRY_PERIPHERAL_QUALIFIER__UNCONNECTED = 1,
		SCSI_INQUIRY_PERIPHERAL_QUALIFIER__UNDEFINED = 2
	};
	enum SCSI__INQUIRY__PERIPHERAL_DEVICE_TYPE {
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__DIRECT_ACCESS = 0,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__SEQUENTIAL_ACCESS = 1,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__PRINTER = 2,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__PROCESSOR = 3,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__WRITE_ONCE = 4,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__CD_DVD = 5,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__SCANNER = 6,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__OPTICAL_MEMORY = 7,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__MEDIUM_CHANGER = 8,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__COMMUNICATIONS = 9,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__STORAGE_ARRAY = 0xC,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__ENCLOSURE_SERVICES = 0xD,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__SIMPLIFIED_DIRECT_ACCESS = 0xE,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__OPTICAL_CARD = 0xF,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__BRIDGE_CONTROLLER = 0x10,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__OBJECT_BASED_STORAGE = 0x11,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__AUTOMATION_IFACE = 0x12,
		SCSI_INQUIRY_PERIPHERAL_DEV_TYPE__UNDEFINED = 0x1F
	};
	enum SCSI__INQUIRY__VERSION {
		SCSI_INQUIRY_VERSION__UNSTANDARDIZED = 0,
		SCSI_INQUIRY_VERSION__SPC = 3,
		SCSI_INQUIRY_VERSION__SPC2 = 4,
		SCSI_INQUIRY_VERSION__SPC4 = 5,
		SCSI_INQUIRY_VERSION__T10_SPC4 = 6
	};
	enum SCSI__INQUIRY__TARGET_PORT_GROUP {
		SCSI_INQUIRY_TARGET_PORT_GROUP__ASYMMETRIC_UNSUPPORTED = 0,
		SCSI_INQUIRY_TARGET_PORT_GROUP__ASYMMETRIC_IMPLICIT = 1,
		SCSI_INQUIRY_TARGET_PORT_GROUP__ASYMMETRIC_EXPLICIT = 2,
		SCSI_INQUIRY_TARGET_PORT_GROUP__ASYMMETRIC_BOTH = 3
	};
	enum SCSI__INQUIRY__CLOCKING {
		SCSI_INQUIRY_CLOCKING__ST = 0,
		SCSI_INQUIRY_CLOCKING__DT = 1,
		SCSI_INQUIRY_CLOCKING__BOTH = 3
	};

	struct SCSI__INQUIRY__DATA {
		uint8_t flags0[2];
		uint8_t version;
		uint8_t flags1;
		uint8_t additionalLength;
		uint8_t flags2[3];
		uint64be_t t10VendorID;
		uint8_t productID[16];
		uint32be_t productRev;
		uint8_t serialNumber[8];
		uint8_t vendorUnique[12];
		uint8_t flags3;
		uint8_t reserved0;
		uint16be_t versionDescriptor[8];
		uint8_t reserved1[22];
		uint8_t vendorSpecific[164];
		SCSI_FIELD_GETTER
	};
	LT_ASSERT_SIZEOF(SCSI__INQUIRY__DATA, 260)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, flags0, 0)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, version, 2)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, flags1, 3)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, additionalLength, 4)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, flags2, 5)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, t10VendorID, 8)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, productID, 16)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, productRev, 32)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, serialNumber, 36)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, vendorUnique, 44)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, flags3, 56)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, versionDescriptor, 58)
	LT_ASSERT_OFFSETOF(SCSI__INQUIRY__DATA, vendorSpecific, 96)

	inline SCSICommand6 INQUIRY(bool evpd, uint8_t pageCode, uint16_t allocLength) {
		SCSICommand6 cmd = {};
		cmd.op = 0x12;
		cmd.data_bytes[0] = evpd ? 1 : 0;
		cmd.data_bytes[1] = pageCode;
		cmd.data_bytes[2] = allocLength >> 8;
		cmd.data_bytes[3] = allocLength;
		return cmd;
	}

	/* --------------
	 * | LOG SELECT |
	 * -------------- */

	enum SCSI__LOG_SELECT__PAGE_CONTROL {
		SCSI_LOG_SELECT_PAGE_CONTROL__THRESHOLD = 0,
		SCSI_LOG_SELECT_PAGE_CONTROL__CUMULATIVE = 1,
		SCSI_LOG_SELECT_PAGE_CONTROL__DEFAULT_THRESHOLD = 2,
		SCSI_LOG_SELECT_PAGE_CONTROL__DEFAULT_CUMULATIVE = 3
	};

	inline SCSICommand10 LOG_SELECT(bool pcr, bool sp, uint8_t pc, uint8_t pageCode, uint16_t paramListLength) {
		SCSICommand10 cmd = {};
		cmd.op = 0x4C;
		cmd.data_bytes[0] = (pcr ? 0x2 : 0) | (sp ? 1 : 0);
		cmd.data_bytes[1] = (pc << 6) | (pageCode & 0x3F);
		cmd.data_bytes[6] = paramListLength >> 8;
		cmd.data_bytes[7] = paramListLength;
